tutorials/catalyticZonesReactingFoam/porousMediaIsoOxidativeCouplingMethane/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    bedSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-100 0 -100 )(100 0.01 100);
        }
    }
    {
        name    bed;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set bedSet;
        }
    }
);


// ************************************************************************* //
